# A simple lisp

```txt
make
./lispy
Lispy Version 0.0.0
Press Ctrl+c to exit
lispy> * (- 10 4) (* 4 2)
48
lispy> eval {len {cons 1 list {2 3 4}}}
4
lispy> fun {add x y} {+ x y}
()
lispy> add 10 20
30
```

